In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('students_index_False.csv')

In [3]:
df

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs032    pavan    5  156  167  180  167.6670
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [4]:
df.drop(0, inplace=True)

In [5]:
df

          usn     name  sem  ia1  ia2  ia3       avg
1  2ka19cs033    pooja    5  165  164  134  154.3330
2  2ka19cs034   prasad    5  112  121  142  125.0000
3  2ka19cs035   pratap    5  167  134  164  155.0000
4  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [6]:
df.reset_index(drop = True, inplace=True) #resets the index and updates df(inplace=True)

In [7]:
df

          usn     name  sem  ia1  ia2  ia3       avg
0  2ka19cs033    pooja    5  165  164  134  154.3330
1  2ka19cs034   prasad    5  112  121  142  125.0000
2  2ka19cs035   pratap    5  167  134  164  155.0000
3  2ka19cs036  pruthvi    5  145  119  113  125.6667

In [8]:
df.isnull()

     usn   name    sem    ia1    ia2    ia3    avg
0  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False
2  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False

In [9]:
df.notnull()

    usn  name   sem   ia1   ia2   ia3   avg
0  True  True  True  True  True  True  True
1  True  True  True  True  True  True  True
2  True  True  True  True  True  True  True
3  True  True  True  True  True  True  True

In [10]:
df['sem'].isnull()

0    False
1    False
2    False
3    False
Name: sem, dtype: bool

In [11]:
newdf = pd.DataFrame({
    'name':['pavan','sanket','rahul'],
    'toy':[np.nan, 'batball', 'cement'],
    'born':[pd.NaT, pd.Timestamp('2001-02-11'), pd.NaT]
})

In [12]:
newdf

     name      toy       born
0   pavan      NaN        NaT
1  sanket  batball 2001-02-11
2   rahul   cement        NaT

In [13]:
newdf.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [14]:
newdf.dropna()

     name      toy       born
1  sanket  batball 2001-02-11

In [15]:
newdf.dropna(how='any') #removes if any one value is null

     name      toy       born
1  sanket  batball 2001-02-11

In [16]:
newdf.dropna(how='any', axis=1)

     name
0   pavan
1  sanket
2   rahul

In [17]:
newdf.dropna(how='all') #removes only if all the values are null

     name      toy       born
0   pavan      NaN        NaT
1  sanket  batball 2001-02-11
2   rahul   cement        NaT

In [18]:
newdf1 = pd.DataFrame({
    'name':['pavan','pavan','rahul'],
    'toy':[np.nan, 'batball', 'cement'],
    'born':[pd.NaT, pd.Timestamp('2001-02-11'), pd.NaT]
})

In [19]:
newdf1

    name      toy       born
0  pavan      NaN        NaT
1  pavan  batball 2001-02-11
2  rahul   cement        NaT

In [20]:
newdf1.drop_duplicates(subset=['name'])

    name     toy born
0  pavan     NaN  NaT
2  rahul  cement  NaT

In [21]:
newdf1.drop_duplicates(subset=['name'], keep='last') #keeps the last occurance

    name      toy       born
1  pavan  batball 2001-02-11
2  rahul   cement        NaT

In [22]:
newdf1.drop_duplicates(subset=['name'], keep=False) #deletes all the occurances

    name     toy born
2  rahul  cement  NaT

In [23]:
df.shape

(4, 7)

In [24]:
df.size

28

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   usn     4 non-null      object
 1   name    4 non-null      object
 2   sem     4 non-null      int64
 3   ia1     4 non-null      int64
 4   ia2     4 non-null      int64
 5   ia3     4 non-null      int64
 6   avg     4 non-null      float64
dtypes: float64(1), int64(4), object(2)
memory usage: 352.0+ bytes

In [26]:
newdf1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [27]:
newdf1['name'].value_counts()

pavan    2
rahul    1
Name: name, dtype: int64

In [28]:
newdf1['toy'].value_counts(dropna=False)

NaN        1
batball    1
cement     1
Name: toy, dtype: int64

In [29]:
newdf1['toy'].value_counts(dropna=True)

batball    1
cement     1
Name: toy, dtype: int64

In [30]:
df.mean()

C:\Users\pavan\AppData\Local\Temp/ipykernel_9288/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

sem      5.000000
ia1    147.250000
ia2    134.500000
ia3    138.250000
avg    139.999925
dtype: float64

In [31]:
df.corr()

     sem       ia1       ia2       ia3       avg
sem  NaN       NaN       NaN       NaN       NaN
ia1  NaN  1.000000  0.644747  0.221759  0.857389
ia2  NaN  0.644747  1.000000  0.154259  0.796166
ia3  NaN  0.221759  0.154259  1.000000  0.589094
avg  NaN  0.857389  0.796166  0.589094  1.000000

In [32]:
df.mean()

C:\Users\pavan\AppData\Local\Temp/ipykernel_9288/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

sem      5.000000
ia1    147.250000
ia2    134.500000
ia3    138.250000
avg    139.999925
dtype: float64

In [33]:
df.median()

C:\Users\pavan\AppData\Local\Temp/ipykernel_9288/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

sem      5.00000
ia1    155.00000
ia2    127.50000
ia3    138.00000
avg    139.99985
dtype: float64

In [34]:
df.std()

C:\Users\pavan\AppData\Local\Temp/ipykernel_9288/3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

sem     0.000000
ia1    25.513069
ia2    20.760539
ia3    21.077239
avg    16.939878
dtype: float64

In [35]:
df.describe()

       sem         ia1         ia2         ia3         avg
count  4.0    4.000000    4.000000    4.000000    4.000000
mean   5.0  147.250000  134.500000  138.250000  139.999925
std    0.0   25.513069   20.760539   21.077239   16.939878
min    5.0  112.000000  119.000000  113.000000  125.000000
25%    5.0  136.750000  120.500000  128.750000  125.500025
50%    5.0  155.000000  127.500000  138.000000  139.999850
75%    5.0  165.500000  141.500000  147.500000  154.499750
max    5.0  167.000000  164.000000  164.000000  155.000000

In [36]:
df.count()

usn     4
name    4
sem     4
ia1     4
ia2     4
ia3     4
avg     4
dtype: int64